# frameworks like oh-my-zsh are supported
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/magic-enter

sindresorhus/pure

# some plugins support deferred loading
mattmc3/zfunctions
zsh-users/zsh-autosuggestions
chitoku-k/fzf-zsh-completions
zsh-users/zsh-history-substring-search kind:defer
